Revit 2026 API

# PointCollection Class

---

A class that represents a set of points created and returned by Revit in response to a query.

SystemObject Autodesk.Revit.DB.PointCloudsPointCollection

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
```
```vb
Public Class PointCollection
	Implements IEnumerable(Of CloudPoint), IDisposable
```
```cpp
public ref class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
```
```fsharp
type PointCollection =
    class
        interface IEnumerable<CloudPoint>
        interface IDisposable
    end
```

The PointCollection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | The number of points in this collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PointCollection |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPointBufferPointer | Returns an unsafe pointer to the buffer in which this collection stores the points. |
|  | GetPointIterator | Creates and returns an iterator for the points contained in this collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace